{
	"events": [
		{
			"Name": "SHERLOCKED",
			"Short Description": "Never trust to general impressions, my boy, but concentrate yourself upon details.",
			"Details": [
				"Do you have it in you to solve a complex murder mystery with intricate plot lines and webs of lies?",
				"Can you see past the veils of deception from enigmas with dark secrets to hide?",
				"If in a world of locked rooms - the man with the key is king, can you unlock the truth behind this thrilling dark tale?",
				"Take part in Sherlocked this year to awaken your inner detective and test your sleuthing skills.",
				"Are you ready to be Sherlocked?"
			]
		},
		{
			"Name": "A.R.G",
			"Short Description": "Immerse the players/teams into a 5-hour adventure with teamwork, solving puzzles, and exploration.",
			"Details": [
				"With the theme Echoes of Eden, this year's Augmented Reality Gaming invites participants into a richly crafted world filled with lore and mysteries of Angels, Demons and the all-powerful mother of creation, Eden.",
				"You will solve clues and progress through challenges trying to figure out why you're in this all-new world and what your purpose is.",
				"You will make choices that will either result in the dominance of Chaos or the propagation of Peace.",
				"The game will have text inputs and a plethora of outputs in the form of text, photos, audios, and more."
			]
		},
		{
			"Name": "LEXICON LEAGUE",
			"Short Description": "Think you can outsmart your friends in a word search? Love logical challenges and solving puzzles?",
			"Details": [
				"Welcome to Lexicon League, where it's all about quick thinking, logic and fun!",
				"Whether you're a vocabulary virtuoso, a spelling whiz, or just a seasoned NYT gameplayer, this event promises a thrilling day of word-based challenges and fun.",
				"Featuring verbles, word searches, crosswords and more!",
				"Bring your A-game and join us for a day of fun and fierce competition. Prizes await the top wordsmiths, and fun is guaranteed for everyone!"
			]
		},
		{
			"Name": "JAM",
			"Short Description": "A high-pressure test of wit and eloquence, where speakers must talk on a given topic for 60 seconds.",
			"Details": [
				"Speak without hesitation, repetition, or deviation.",
				"It's no easy feat—every stutter, unnecessary pause, or filler word can cost you.",
				"The other contestants are ever-watchful, ready to pounce on mistakes.",
				"It's a thrilling game of focus and finesse, where even the smallest misstep can make or break your performance."
			]
		},
		{
			"Name": "SHIPWRECKED",
			"Short Description": "Embark on a unique challenge where participants find themselves on a sinking ship.",
			"Details": [
				"Participants embody characters as diverse as the high seas themselves. From donuts to cunning villains, these characters can be anything and everything!",
				"It's a mixed bowl to play around satire, wit, banter, pop culture references, and beyond.",
				"In this test of persuasion and spontaneity, the coveted life jacket becomes the focal point, and individuals must articulate why they stand as the most deserving passenger."
			]
		},
		{
			"Name": "DEVIL'S ADVOCATE",
			"Short Description": "Dare to defend the indefensible in this provocative debate event.",
			"Details": [
				"This event challenges participants to argue in favor of morally questionable motions.",
				"Test your persuasive skills as you step into the shoes of the devil and advocate for ideas that go against conventional ethics.",
				"It's a battle of rhetoric and creativity where only the boldest and most convincing will triumph!"
			]
		},
		{
			"Name": "RHYME RODEO",
			"Short Description": "A fast-paced, collaborative poetry game for teams of 3 to 5 participants.",
			"Details": [
				"Teams take turns crafting stanzas, building on each other's verses to create a flowing, rhyming poem.",
				"The challenge? You've got just 5 minutes to whip up the best masterpiece while keeping the rhyming scheme intact.",
				"Do you think your team's got what it takes to gallop to glory?"
			]
		},
		{
			"Name": "DEBATE CASINO",
			"Short Description": "Step into the arena of wit and strategy with this thrilling 3v3 debate event.",
			"Details": [
				"This event combines the art of argumentation with the excitement of gambling.",
				"Each team begins with 100 points and strategically places bets on their members for each round of 1v1 debates.",
				"The stakes are high: the winner of each 1v1 debate doubles the bet amount for their team.",
				"Show off your debating prowess, make calculated bets, and outwit the competition to emerge victorious!"
			]
		},
		{
			"Name": "YINYANG",
			"Short Description": "Create complementary literary pieces that mirror and complete each other.",
			"Details": [
				"Without darkness, the stars would have no stage to shine upon.",
				"Two forces, opposite yet intertwined, forever shaping the rhythm of existence.",
				"Light and shadow. Chaos and order. Fire and water.",
				"Every story has two sides—can you master the art of crafting both?",
				"In teams of two, you'll create complementary literary pieces that mirror and complete each other, like puzzle pieces in the grand design of the cosmos.",
				"Can you and your partner find balance in the chaos?"
			]
		}
	]
}
