{
	"events": [
		{
			"Name": "Sherlocked",
			"Short Description": "Solve a complex murder mystery through teamwork, puzzles, and exploration.",
			"Details": [
				"In a world of locked rooms, the man with the key is king. Can you unlock the truth behind this thrilling dark tale?",
				"Join us for a thrilling immersion into a world that challenges players to unravel a 5-hour narrative through teamwork, puzzles, and exploration!",
				"With the theme Echoes of Eden, this year's ARG invites participants into a richly crafted world filled with lore and mysteries, where each clue and challenge brings them closer to uncovering hidden truths.",
				"Players navigate through interconnected levels, solve intricate puzzles, and navigate a collaborative storytelling experience designed to engage their creativity and wit."
			]
		},
		{
			"Name": "Lexicon League",
			"Short Description": "Compete in challenging crosswords, word searches, and spelling bees.",
			"Details": [
				"For fans of NYT games, grammar enthusiasts, and word game lovers, this is the ultimate playground.",
				"Dive into challenging crosswords, fast-paced word searches, and thrilling spelling bees designed to test your linguistic skills and competitive edge.",
				"Whether you're a casual word geek or a die-hard language aficionado, this event promises fun, wit, and a celebration of all things words!"
			]
		},
		{
			"Name": "Just a Minute",
			"Short Description": "Engage in fast-paced wordplay where every second and word counts.",
			"Details": [
				"Enter a realm of linguistic brilliance with JAM, where every word counts.",
				"Rise to the challenge, where every second adds to your score.",
				"With only a minute to speak, every pause, every mistake, and every hesitation threatens the balance, as others stand ready to seize on your every flaw.",
				"Join us to experience a fast-paced word play with fun twists"
			]
		},
		{
			"Name": "Shipwrecked",
			"Short Description": "Embody unique characters and persuade others why you deserve the life jacket on a sinking ship.",
			"Details": [
				"Embark on a unique challenge with 'Shipwrecked', where participants find themselves on a sinking ship, embodying characters as diverse as the high seas themselves.",
				"From donuts to cunning villains these characters can be anything and everything!",
				"It's a mixed bowl to play around satire, wit, banter, pop culture references and beyond.",
				"In this test of persuasion and spontaneity , the coveted life jacket becomes the focal point, and individuals must articulate why they stand as the most deserving passenger."
			]
		},
		{
			"Name": "Devil's Advocate",
			"Short Description": "Defend morally challenging opinions and put your debating skills to the test.",
			"Details": [
				"Do you often find yourself questioning the rationale behind mainstream morality?",
				"Do you feel you can force society to rethink their principles purely through argumentation?",
				"Put your convincing and speaking skills to the test by defending the indefensible and advocating for the most morally reprehensible opinions across geopolitics, culture, science and art with Devil's Advocate."
			]
		},
		{
			"Name": "Rhyme Rodeo",
			"Short Description": "Collaborate to create a rhyming poem in a fast-paced, team-based challenge.",
			"Details": [
				"Rhyme Rodeo is a fast-paced, collaborative poetry game where teams of 3 to 5 participants take turns crafting stanzas, building on each other's verses to create a flowing, rhyming poem.",
				"The challenge? You've got just 5 minutes to whip up the best masterpiece while keeping the rhyming scheme intact.",
				"Do you think your team's got what it takes to gallop to glory?"
			]
		},
		{
			"Name": "Debate Casino",
			"Short Description": "Participate in themed 3v3 debates and test your reasoning abilities.",
			"Details": [
				"Debating is an art which leads us to bring out the zenith of our creative skills.",
				"It enhances our views and makes us deliver what we want to deliver rather than what the world expects us to deliver.",
				"Debate Casino is a 3v3 debate with theme based topics where you can push your mental faculties to the extreme and really test the depths of reason."
			]
		},
		{
			"Name": "Yin-Yang",
			"Short Description": "Write complementary pieces that embody the concept of duality and create a harmonious whole.",
			"Details": [
				"Black and white. Day and night. Fire and water. The universe has always thrived on the notion of duality and this literary event aims to focus on striking that balance.",
				"Participate in teams of two to write complementary pieces that together make up a whole."
			]
		},
		{
			"Name": "A.R.G",
			"Short Description": "Immerse yourself in a narrative-driven augmented reality puzzle adventure.",
			"Details": [
				"Join us for a thrilling immersion into a world that challenges players to unravel a 5-hour narrative through teamwork, puzzles, and exploration!",
				"With the theme 'Echoes of Eden,' this year's ARG invites participants into a richly crafted world filled with lore and mysteries.",
				"Each clue and challenge brings them closer to uncovering hidden truths. Players navigate through interconnected levels, solve intricate puzzles, and explore a collaborative storytelling experience designed to engage their creativity and wit."
			]
		}
	]
}
