{
	"events": [
		{
			"Name": "SHERLOCKED",
			"Short Description": "Never trust to general impressions, my boy, but concentrate yourself upon details.",
			"Details": [
				"Do you have it in you to solve a complex murder mystery with intricate plot lines and webs of lies?",
				"Can you see past the veils of deception from enigmas with dark secrets to hide?",
				"If in a world of locked rooms - the man with the key is king, can you unlock the truth behind this thrilling dark tale?",
				"Take part in Sherlocked this year to awaken your inner detective and test your sleuthing skills.",
				"Are you ready to be Sherlocked?"
			]
		},
		{
			"Name": "A.R.G",
			"Short Description": "Join us for an immersive journey into a world that challenges players to uncover a hidden narrative through puzzles, investigation, and exploration.",
			"Details": [
				"With the theme Luna Obscura, this year’s ARG draws participants into a carefully constructed digital space where secrets lie beneath the surface and nothing is revealed all at once. ",
				"Each clue, interaction, and discovery pulls players deeper into the experience.",
				"As the game unfolds on Discord, players navigate interconnected layers, solve intricate puzzles, and piece together fragments of information to reveal the larger picture.",
				"Designed to test observation, logic, and persistence, Luna Obscura offers a slow-burning experience where meaning emerges through curiosity and careful thought."
			]
		},
		{
			"Name": "LEXICON LEAGUE",
			"Short Description": "A fast-paced word challenge event for crossword, spelling, and language enthusiasts.",
			"Details": [
				"For fans of NYT games, grammar enthusiasts, and word game lovers, this is the ultimate playground.",
				"Dive into challenging crosswords, fast-paced word searches, and thrilling spelling bees designed to test your linguistic skills and competitive edge.",
				"Whether you ’ re a casual word geek or a die-hard language aficionado, this event promises fun, wit, and a celebration of all things words!"
			]
		},
		{
			"Name": "JAM",
			"Short Description": "A fast-paced word game where participants must speak quickly and accurately, with every pause, mistake, and hesitation affecting their score.",
			"Details": [
				"Enter a realm of linguistic brilliance with JAM, where every word counts.",
				"Rise to the challenge, where every second adds to your score.",
				"With only a minute to speak, every pause, every mistake, and every hesitation threatens the balance, as others stand ready to seize on your every flaw." ,
				"Join us to experience a fast-paced word play with fun twists."

			]
				
		},
		{
			"Name": "ECLIPSE TRIALS",
			"Short Description": "A multi-round literary challenge with interactive word games, where participants qualify through prelims to reach a gameshow-style finale.",
			"Details": [
				"Eclipse Trials is a multi-round literary event themed around Luna Obscura.", 
				"It features three preliminary rounds with fun, interactive word-based challenges.", 
				"Participants must qualify in at least two rounds to advance.", 
				"The event concludes with a gameshow-style final round, conducted over two days of the fest."
			]
		},
		{
			"Name": "DEVIL'S ADVOCATE",
			"Short Description": "Challenge your persuasive skills by defending the indefensible across politics, culture, science, and art.",
			"Details": [
				"Do you often find yourself questioning the rationale behind mainstream morality?", 
				"Do you feel you can force society to rethink their principles purely through argumentation?",
				"Put your convincing and speaking skills to the test by defending the indefensible and advocating for the most morally reprehensible opinions across geopolitics, culture, science and art with Devil’ s Advocate."
			]
		},
		{
			"Name": "LITERARY LABYRINTH",
			"Short Description": "A creative scavenger hunt where participants decode hidden clues in prose and poetry and craft original writings to reach the final round.",
			"Details": [
				"Literary Labyrinth is for those whose love to look between the lines, and figure out the inner meaning of prose and poetry.", 
				"A scavenger hunt meant to scratch the creative part of your mind: you must identify the hidden key in the clues to lead you to your final destination.",
				"Along the way, you are tasked to create a unique written piece using your imaginative prowess, leading you into the ultimate round."
			]
		},
		{
			"Name": "MOONLIT MARGINS",
			"Short Description": "A multi-round creative writing event testing participants’ skills across stories, poetry, journaling, and more, scored to find the top three winners.",
			"Details": [
				"A literary event that will involve multiple creative writing rounds, covering a variety of literary forms such as fictional short stories, poetry, journaling, argumentative writing etc.", 
				"These will be designed to test the creative thinking and literary prowess of participants.", 
				"The entries will be judged using predetermined rubrics, and scored accordingly, and the three participants with highest total points will win the event."
			]
		},
		{
			"Name": "PROSE POSE PARADE",
			"Short Description": "Participants bring literary and fictional characters to life through creative costumes and expressive, character-driven speeches.",
			"Details": [
				"This event invites participants to step into the world of fiction or nonfiction by dressing up as iconic personalities, fictional characters, or literary figures.", 
				"Attendees will not only showcase their creativity in costume design but also present captivating speeches emulating the body language and essence of their chosen personas."
			]
		}
	]
}
