[
	{
		"name": "Sherlocked",
		"Short Description": "A mystery challenge where participants unravel clues and secrets to solve a complex murder case.",
		"Details": [
			"\"Never trust to general impressions, my boy, but concentrate yourself upon details\"",
			"Do you have it in you to solve a complex murder mystery with intricate plot lines andwebs of lies? Can you see past the veils of deception from enigmas with dark secretsto hide?",
			"If in a world of locked rooms - the man with the key is king, can you unlock the truthbehind this thrilling dark tale?",
			"Take part in sherlocked this year to awaken your inner detective and test yoursleuthing skills.",
			"Are you ready to be Sherlocked?"
		],

		"Club": "ELAS",
		"filter": "Puzzles",
		"bglink": "/assets/events/sherlocked.jpeg",
		"rules": [
			"You can participate individually or in teams of up to 3 members.",
			"Suspects will be introduced in three separate groups during the event, each group bringing new details and evidence. ",
			"Your task is to interrogate the suspects, analyse the evidence and piece together the entire plot, including the motives, timeline and the main culprit."
		]
	},
	{
		"name": "Lexicon League",
		"Short Description": "Compete in challenging crosswords, word searches, and spelling bees.",
		"Details": [
			"For fans of NYT games, grammar enthusiasts, and word game lovers, this is the ultimate playground.",
				"Dive into challenging crosswords, fast-paced word searches, and thrilling spelling bees designed to test your linguistic skills and competitive edge.",
				"Whether you ’ re a casual word geek or a die-hard language aficionado, this event promises fun, wit, and a celebration of all things words!"
		],
		"Club": "ELAS",
		"filter": "Literary Arts",
		"bglink": "/assets/events/basic_2.jpg",
		"rules": [
			"Round 1: Word Search",
			"A classic word puzzle to kick things off! Participants will be given a word grid filled with hidden words.",
			"Find as many words as possible within the allotted time.",
			"Words may appear in straight lines, diagonals, or reverse order.",
			"Each word found earns points; bonus points for finding all hidden words.",
			"Round 2: Crosswords",
			"Solve custom crossword puzzles designed to challenge your knowledge and reasoning skills.",
			"Participants will have a set time to solve the give crosswords",
			"Correct answers earn points, while incorrect or blank answers receive no points",
			"Time taken to complete the crossword will be considered in case of a tie.",
			"Round 3: Categories",
			"A test of quick thinking and vocabulary. Participants will be given a category and must list as many relevant words as possible.",
			"Round 4: Verbles",
			"Taking the popular game Verble to the next level, this round tests your speed and competency to deduce hidden words with limited time and guesses.",
			"Each participant will be given a specific time to solve as many words as they can. Points will be for each word guessed .",
			"The participant that guesses the most number of words within the stipulated time wins the round.",
			"Bring your A-game and join us for a day of fun and fierce competition. Prizes await the top wordsmiths, and fun is guaranteed for everyone!"
		]
	},
	{
		"name": "ECLIPSE TRIALS",
		"Short Description": "A multi-round literary challenge with interactive word games, where participants qualify through prelims to reach a gameshow-style finale.",
		"Details": [
			"Eclipse Trials is a multi-round literary event themed around Luna Obscura.",
			"It features three preliminary rounds with fun, interactive word-based challenges.", 
			"Participants must qualify in at least two rounds to advance. The event concludes with a gameshow-style final round, conducted over two days of the fest."
		],
		"Club": "ELAS",
		"filter": "Literary Arts",
		"bglink": "/assets/events/basic_2.jpg",
		"rules": [
			"The competition is individual; there are no teammates.",
			"The moderator's decision is final on all matters.",
			"Participants must speak on a given topic for 60 seconds, earning 1 point for each second spoken.",
			"All proper nouns must be introduced at the beginning of the speech.",
			"Copying or repeating another player's speech will result in penalties.",
			"Speakers must remain still while speaking and avoid gestures.",
			"The moderator can introduce special objections during the game."
		]
	},
	{
		"name": "JAM",
		"Short Description": "A fast-paced word game where participants must speak quickly and accurately, with every pause, mistake, and hesitation affecting their score.",
		"Details": [
			"Enter a realm of linguistic brilliance with JAM, where every word counts.",
			"Rise to the challenge, where every second adds to your score.",
			"With only a minute to speak, every pause, every mistake, and every hesitation threatens the balance, as others stand ready to seize on your every flaw." ,
			"Join us to experience a fast-paced word play with fun twists."
		],
		"Club": "ELAS",
		"filter": "Expression",
		"bglink": "/assets/events/shipwrecked.jpeg",
		"rules": [ 
			"The event has two rounds - Prelims and Finals.",
			"4-6 participants will be grouped together for one topic.",
			"Every member has to choose one item for the specified topic and defend why the item they chose deserves the jacket the most. "
		]
	},
	{
		"name": "Devil's Advocate",
		"Short Description": "Challenge your persuasive skills by defending the indefensible across politics, culture, science, and art.",
		"Details": [
			"Do you often find yourself questioning the rationale behind mainstream morality?", 
			"Do you feel you can force society to rethink their principles purely through argumentation?",
			"Put your convincing and speaking skills to the test by defending the indefensible and advocating for the most morally reprehensible opinions across geopolitics, culture, science and art with Devil’ s Advocate."
		],
		"Club": "ELAS",
		"filter": "Discussions",
		"bglink": "/assets/events/da.jpg",
		"rules": [
			"Participant Selection: This is an individual event open to all daring debaters. ",
			" Motion Assignment: Each participant will be given a morally questionable motion to defend. ",
			"Preparation Time: Participants will have 2 minutes to prepare their arguments.  ",
			"Debate Format: Each participant gets 1 minute to present their case. ",
			"Judging Criteria: Participants will be judged on creativity, persuasiveness, confidence, and their ability to present a compelling argument within the time limit. ",
			"Winning: The participant who best embraces the role of the devil's advocate and convinces the judges wins the title. "
		]
	},
	{
		"name": "Literary Labyrinth",
		"Short Description": "A creative scavenger hunt where participants decode hidden clues in prose and poetry and craft original writings to reach the final round.",
		"Details": [
			"Literary Labyrinth is for those whose love to look between the lines, and figure out the inner meaning of prose and poetry.", 
			"A scavenger hunt meant to scratch the creative part of your mind: you must identify the hidden key in the clues to lead you to your final destination.",
			"Along the way, you are tasked to create a unique written piece using your imaginative prowess, leading you into the ultimate round."
		],
		"Club": "ELAS",
		"filter": "Literary Arts",
		"bglink": "/assets/events/basic_2.jpg",
		"rules": [
			"The game is played in teams of 3-5 members. If you're playing individually, we'll pair you up with a team on the spot",
			"Each participant writes one line of the poem based on the topic and follows the rhyme scheme established by the previous player. This continues until either the poem is finished, or the timer of 5 minutes runs out.",
			"Poems will be judged on adherence to the topic, creativity, rhyme scheme, grammar and overall flow. The more cohesive and imaginative the verses, the better! Judges will also appreciate clever wordplay and how well each player builds on the previous lines."
		]
	},
	{
		"name": "Moonlight Margins",
		"Short Description": "A multi-round creative writing event testing participants’ skills across stories, poetry, journaling, and more, scored to find the top three winners.",
		"Details": [
			"A literary event that will involve multiple creative writing rounds, covering a variety of literary forms such as fictional short stories, poetry, journaling, argumentative writing etc.", 
			"These will be designed to test the creative thinking and literary prowess of participants.", 
			"The entries will be judged using predetermined rubrics, and scored accordingly, and the three participants with highest total points will win the event."
		],
		"Club": "ELAS",
		"filter": "Discussions",
		"bglink": "/assets/events/debatecasino.jpeg",
		"rules": [
			"Team Formation: Each team comprises three members.",
			"Starting Points: Each team begins with 100 points in their virtual casino.",
			"Betting Rules: Before each 1v1 round, teams must decide how many points to bet on their representative for that round.",
			"1v1 Debates: One member from each team will engage in a debate on a given topic. Each 1v1 lasts for 5 minutes.",
			"Scoring: The winner of the 1v1 debate doubles their team's bet amount and adds it to the team's total points.",
			"Strategy: Teams must decide their bets wisely, balancing risks and rewards for future rounds",
			"Winning: The team with the highest points after all rounds will be crowned the Debate Casino champions."
		]
	},
	{
		"name": "Antakshari",
		"Short Description": "A lively Bollywood-themed Antakshari with song guessing, dramatic dialogues, and song-and-dance challenges leading to a grand finale.",
		"Details": [
			"Get ready for an exciting journey through the magic of Bollywood with VM Antakshari by Hindi Tarang!",
			"The competition heats up as teams showcase their creativity and passion for Bollywood, leading to a grand finale where the ultimate Antakshari champions will be crowned!",
			"This event blends nostalgia, fun, and friendly competition with three thrilling rounds:"
		],
		"Club": "Hindi Tarang",
		"filter": "Traditional",
		"bglink": "/assets/events/basic_2.jpg",
		"rules": [
			"Round 1: Bollywood Song Guessing",
			"Round 2: Dialogue Delivery Drama",
			"Round 3: The Song and Dance Challenge"
		]
	},
	{
		"name": "Geeta Spardha",
		"Short Description": "A sloka recitation event where participants chant verses from the Bhagavad Gita, judged on memorization, pronunciation, and rhythm.",
		"Details": [
			"Geeta spardha is an event where participants, typically students or devotees, recite slokas of Bhagavad Gita from any adhyay of their choice",
			"The purpose of the competition is to encourage participants to engage deeply with the holy bhagavad Gita and appreciate the Sanskrit language.",
			"Participants have to recite a minimum of 8 Slokas."
		],
		"Club": "SAFL",
		"bglink": "/assets/events/helm.jpeg",
		"rules": [
			"The participants will be judged based on the following aspects:",
			"Memorization -20 points",
			"Pronunciation -20 points ",
			"Timing and rhythm -10 points"
		]
	},
	{
		"name": "Bamboozled",
		"Short Description": "A high-stakes strategy game inspired by psychological anime, testing trust, deception, and teamwork across intense multi-round challenges.",
		"Details": [
			"Step into the electrifying world of Bamboozled, where cunning strategy meets heart-pounding adventure.", 
			"Inspired by the mind-bending tension of anime like Tomodachi Game and Kakegurui, this event is not just a game – it’s a battle of wits, loyalty, and survival.", 
			"Prepare to question every decision as you face thrilling challenges that will test your trust, tactics, and teamwork.",
			"Across four uniquely intense rounds, you 'll dive into games that will push your mental acumen to the limit.", 
			"Each round will introduce a new layer of complexity, from navigating shifting alliances to mastering deception and probability.", 
			"Every game will challenge a different facet of your intellect and instincts, ensuring there ' s never a dull moment.", 
			"With every elimination, the stakes climb higher, keeping you on the edge of your seat.",
			"Let the games begin – and may the sharpest minds prevail."
		],
		"Club": "SAFL",
		"filter": "Traditional",
		"bglink": "/assets/events/helm.jpeg",
		"rules": [
			"Each team consists of 3 players. Once formed, teams cannot be changed or swapped during the event.",
			"The event consists of 4 rounds, each featuring a different game. Teams will face elimination after Rounds 2 and 3, based on their performance.",
			"The remaining teams will face off in a high-stakes finale to determine the winner.",
			"Any attempt to cheat, disrupt, or manipulate the games outside of the event ' s structure will result in immediate disqualification.",
			"Follow all instructions provided by the coordinators. Failure to comply may lead to penalties or elimination. Maintain a respectful environment for all participants and organizers. Get ready to be bamboozled!"
		]
	},
	{
		"name": "H.E.L.M Quiz",
		"Short Description": "An intellectually engaging quiz exploring History, Etymology, Literature, and Mythology through thought-provoking rounds.",
		"Details": [
			"The HELM Quiz is a fascinating journey through the realms of History, Etymology, Literature, and Mythology.", 
			"It’ s an intellectually stimulating event that invites participants to delve into the stories, origins, and cultural treasures that shape our world.", 
			"Whether you’re a history buff, a lover of words, a literary enthusiast, or intrigued by ancient myths and legends, the HELM Quiz offers a unique opportunity to explore these interconnected fields.", 
			"With thought-provoking questions and engaging rounds, it’ s an event that challenges the mind while celebrating the richness of human heritage."
		],
		"Club": "Quiz Club",
		"filter": "Quizzes",
		"bglink": "/assets/events/helm.jpeg",
		"rules": [
			"Team Size: 1-3 members",
			"Mode: Offline",
			"Judging Criteria: None",
			"No. of Rounds: 2 (Prelims + Finals)",
			"Would be hosted by Quiz Club",
			"This quiz will have two rounds",
			"The first round will be a preliminary round of 20 questions.",
			"Top 6 teams from the first round will qualify for the finals.",
			"The final round will be a bounce and pounce format with some additional rounds",
			"Top 3 teams in the finals will be the winners"
		]
	},
	{
		"name": "Prose Pose Parade",
		"Short Description": "A character portrayal event where participants dress as iconic figures and deliver speeches capturing their persona and essence.",
		"Details": [
			"This event invites participants to step into the world of fiction or nonfiction by dressing up as iconic personalities, fictional characters, or literary figures.", 
			"Attendees will not only showcase their creativity in costume design but also present captivating speeches emulating the body language and essence of their chosen personas."
		],
		"Club": "Fashion Club",
		"filter": "Expression",
		"bglink": "/assets/events/basic_2.jpg",
		"rules": [
			"The speech will be for 3 minutes and you will be judged based on how well you have impersonated the character you have chosen both in terms of fashion as well as elocution."
		]
	},
	{
		"name": "Symphonies of the Soul",
		"Short Description": "A creative writing event where live music inspires participants to craft original poems and lyrics.",
		"Details": [
			"Lose yourself in the music, and translate the moment into words.",
			"The Music club is here to bring out the poet within you. They play the instruments and you write the songs.",
			"Let the music guide you, and help create your masterpiece."
		],
		"Club": "Music Club",
		"filter": "Expression",
		"bglink": "/assets/events/music.jpeg",
		"rules": []
	}
]
